app/controllers/songs_controller.rb

  def new
    #we need to see if :artist_id is set and if artist_id is valid artist
    if params[:artist_id] && !Artist.exists?(params[:artist_id])
---
SELECT  1 AS one FROM "artists" WHERE "artists"."artist_id" = '1' LIMIT 1
SELECT "artists".* FROM "artists"

  def edit
    if params[:artist_id]
      @nested = true
      #find and validate the artist
      artist = Artist.find_by(id: params[:artist_id])
      if artist.nil?
        #no artist is found
        redirect_to artists_path, alert: "Artist not found."
      else
        #we limit scope to only songs by artist_id
        @song = artist.songs.find_by(id: params[:id])
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 1234]]
SELECT  "songs".* FROM "songs" WHERE "songs"."artist_id" = ? AND "songs"."id" = ? LIMIT 1  [["artist_id", 1], ["id", 1234]]